bpf-macro-benchmark/memcached-results/test5.txt
realtive baseline

Server: 127.0.0.1:11211
Duration: 50 seconds
Threads: 4
Clients per thread: 10
Write/Read Ratio: 1:10

4         Threads
10        Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        29353.17          ---          ---         0.12546         0.08700         0.63900         1.14300      2003.30 
Gets       293528.07       712.50    292815.56         0.12392         0.08700         0.63900         1.12700      7463.93 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     322881.24       712.50    292815.56         0.12406         0.08700         0.63900         1.12700      9467.23 

with nested bpfs

ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        10682.23          ---          ---         0.33510         0.32700         0.87900         1.55900       729.05 
Gets       106818.36       501.52    106316.84         0.33381         0.32700         0.88700         1.54300      2730.83 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     117500.59       501.52    106316.84         0.33393         0.32700         0.88700         1.55100      3459.87